#!/bin/sh

a=helloworld
b="hello world"
c=helloWorldzzz
d="heLlo world"

###################################
# test "$a" \> "$b" 
# #注意这里的字符串a和b中由于出现了空格，因此被替换时会被认为有多个字符串进行判断，导致出错,并返回2这个值
# echo $?

# test "$a" \> "$c" #注意要加转义符号以区分重定向与比较大小的符号区别
# echo $? #这里只会比较第一个遇到的不同的字符的ascii码值

# test "$a" = "$d"
# echo $?

# [ "$a" = "$b" ]
# echo $?
####################################


####################################
#判断文件

# #找是否存在
# [ -e 333.c ]
# echo $?

# [ -e 111.c ]
# echo $?

#判断内容是否存在
test -s 111.c
echo $?

test -s 222.c
echo $?


